# Задача 5
num = 0
try:
    while num != "q":
        for i in map(int(input('Для выхода введите q Введите число через пробел').split())
            num +=i
        print(num)
except ValueError:
    print(num)