# Задача 3

month = int(input('Введите месяц'))
year=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
if  3 <= month <= 5:
    print('Весна')
elif 6 <= month < 9:
    print('Лето')
elif 6 <= month <= 11:
    print('Осень')
else:
    print('Зима')
month = int(input('Введите месяц'))
year = {'Зима':12, 'Зима':1, 'Зима':2, 'Весна':3, 'Весна':4, 'Весна':5, 'Лето':6, 'Лето':7, 'Лето':8, 'Осень':9, 'Осень':10,'Осень':11}
print(year.get(month))